#+title: Dashboard
*** HABIT
#+begin_src emacs-lisp
(org-babel-load-file
 (expand-file-name "/Users/khanh/Dropbox/Code/OrgHabit.org"))
#+end_src

#+RESULTS:
: Loaded /Users/khanh/Dropbox/Code/OrgHabit.el

#+begin_src emacs-lisp

(defun ndk-dashboard-habitance-section ()
  (insert-section-heading "Habitance" "orange")
  (let ((list (dashboard-get-agenda "+/HABIT" nil)))
    (dolist (element list nil)
      (create-todo-widget element)

      (let* ((list-time "")
             (count 0)
             (todo-obj (get-text-property 0 'habit-parse-todo-obj element))
             (moment (time-subtract nil (* 3600 org-extend-today-until)))
             (closed-dates (get-text-property 0 'closed-dates element)))
        (when closed-dates

          (while closed-dates
            (let ((date (car closed-dates)))
              (when (string= (format-time-string "%Y-%m-%d" date) (format-time-string "%Y-%m-%d"))
                (setq count (+ count 1))
                (setq list-time (concat list-time " " (format-time-string "%H:%M" date))))
              )
            (setq closed-dates (cdr closed-dates)))
          (widget-create 'item
                         :tag (concat
                               (propertize (format "%18s(%d times)%s" "" count list-time) 'face '(:foreground "green"))
                               (org-habit-build-graph
                                todo-obj
                                (time-subtract moment (days-to-time org-habit-preceding-days))
                                moment
                                (time-add moment (days-to-time org-habit-following-days)))
                               )
                         )
          )
        )

      )
    )
  )
#+end_src

#+RESULTS:
: ndk-dashboard-habitance-section


** Plug my-menu to the dashboard
#+begin_src emacs-lisp
(set-face-attribute 'button nil :inherit nil)
(defun ndk-dashboard-widget-mymenu()
  (ndk-dashboard-files-section)
  (ndk-dashboard-inprogress-section)
  (ndk-dashboard-work-section)
  (ndk-dashboard-agenda-section)
  (ndk-dashboard-habitance-section)
  (ndk-dashboard-health-section)
  (ndk-dashboard-done-section)
  )
(setq +ndk-dashboard-functions
      '(ndk-dashboard-widget-banner
        ndk-dashboard-widget-mymenu))

(map! "<f2>" (lambda() (interactive) (+ndk-dashboard/open (selected-frame))))
(+ndk-dashboard/open (selected-frame))


#+end_src

#+RESULTS:
: #<buffer *scratch*>
